In [5]:
import pandas as pd
import numpy as np

In [8]:
## create a dataframe
df=pd.DataFrame(data=np.arange(0,20).reshape(5,4),index=["row1","row2","row3","row4","row5"],columns=["column1","column2","column3","column4"])

In [9]:
type(df)

pandas.core.frame.DataFrame

In [10]:
##some inbuilt functions in pandas
df.head() #it will give us the top 5 records

      column1  column2  column3  column4
row1        0        1        2        3
row2        4        5        6        7
row3        8        9       10       11
row4       12       13       14       15
row5       16       17       18       19

In [11]:
## if we want to get last 5 records
df.tail()

      column1  column2  column3  column4
row1        0        1        2        3
row2        4        5        6        7
row3        8        9       10       11
row4       12       13       14       15
row5       16       17       18       19

In [12]:
##if we just want to take only first 2 records, then we will mention it as:
df.head(2)

      column1  column2  column3  column4
row1        0        1        2        3
row2        4        5        6        7

In [13]:
df.tail(4)

      column1  column2  column3  column4
row2        4        5        6        7
row3        8        9       10       11
row4       12       13       14       15
row5       16       17       18       19

In [14]:
df.describe()

         column1    column2    column3    column4
count   5.000000   5.000000   5.000000   5.000000
mean    8.000000   9.000000  10.000000  11.000000
std     6.324555   6.324555   6.324555   6.324555
min     0.000000   1.000000   2.000000   3.000000
25%     4.000000   5.000000   6.000000   7.000000
50%     8.000000   9.000000  10.000000  11.000000
75%    12.000000  13.000000  14.000000  15.000000
max    16.000000  17.000000  18.000000  19.000000

In [15]:
##want to retrieve 3 columns from the dataframe
df[['column1','column2','column3']]

      column1  column2  column3
row1        0        1        2
row2        4        5        6
row3        8        9       10
row4       12       13       14
row5       16       17       18

In [17]:
# want to retrieve only 1 column
df[['column1']]

      column1
row1        0
row2        4
row3        8
row4       12
row5       16

In [20]:
type(df['column1']) ##if we take column values with row index then it becomes a series...if we combine multiple series, then 
#it becomes a dataframe

pandas.core.series.Series

In [21]:
##if we want to retrieve 1 and 3 row
## loc(location),,we can give row index name
df.loc[['row1','row3']]

      column1  column2  column3  column4
row1        0        1        2        3
row3        8        9       10       11

In [22]:
type(df.loc[['row1','row3']])

pandas.core.frame.DataFrame

In [23]:
##if we dont want to retrieve rows with row names, we can retrive it with the index number of that row,,
## iloc will be used (index location)
df.iloc[0:3,0:2]

      column1  column2
row1        0        1
row2        4        5
row3        8        9

In [24]:
df

      column1  column2  column3  column4
row1        0        1        2        3
row2        4        5        6        7
row3        8        9       10       11
row4       12       13       14       15
row5       16       17       18       19

In [25]:
df.iloc[2:4,1:3]

      column2  column3
row3        9       10
row4       13       14

In [26]:
## if we want to convert this dataframe into array just write .values
df.iloc[2:4,1:3].values

array([[ 9, 10],
       [13, 14]])

In [27]:
df=pd.DataFrame(data=[[1,np.nan,2],[1,3,4]],index=["row1","row2"],columns=['column1','column2','column3'])

In [28]:
df

      column1  column2  column3
row1        1      NaN        2
row2        1      3.0        4

In [30]:
df.isnull() ##(isnull: used to detect missing values in a dataframe)

      column1  column2  column3
row1    False     True    False
row2    False    False    False

In [31]:
df.isnull().sum()

column1    0
column2    1
column3    0
dtype: int64

In [32]:
df.isna() ##also used to detect missing values (have the sme functionality as isnull)

      column1  column2  column3
row1    False     True    False
row2    False    False    False

In [33]:
type(np.nan)

float

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, row1 to row2
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   column1  2 non-null      int64
 1   column2  1 non-null      float64
 2   column3  2 non-null      int64
dtypes: float64(1), int64(2)
memory usage: 64.0+ bytes

In [35]:
## value counts inseries only
df['column1'].value_counts() ##will found out unique value in each column and will tell us how many number of times it is 
                              #getting repeated.

column1
1    2
Name: count, dtype: int64

In [36]:
df['column2'].value_counts()

column2
3.0    1
Name: count, dtype: int64

In [37]:
## how many unique values are there
df['column1'].unique

<bound method Series.unique of row1    1
row2    1
Name: column1, dtype: int64>

In [38]:
df['column3'].nunique() ##count of the unique values present in a column/row

2

In [40]:
df

      column1  column2  column3
row1        1      NaN        2
row2        1      3.0        4

In [39]:
df.nunique(axis=1)## will check unique values row wise

row1    2
row2    3
dtype: int64

In [42]:
df.nunique(axis=0) ## will check for unique values column wise

column1    1
column2    1
column3    2
dtype: int64

In [43]:
df=pd.DataFrame(data=np.arange(0,20).reshape(5,4),index=["row1","row2","row3","row4","row5"],columns=["column1","column2","column3","column4"])

In [44]:
df

      column1  column2  column3  column4
row1        0        1        2        3
row2        4        5        6        7
row3        8        9       10       11
row4       12       13       14       15
row5       16       17       18       19

In [46]:
df['column2']>5

row1    False
row2    False
row3     True
row4     True
row5     True
Name: column2, dtype: bool

In [47]:
df[df['column2']>5] ##will take out all the rows greater than 5

      column1  column2  column3  column4
row3        8        9       10       11
row4       12       13       14       15
row5       16       17       18       19

In [50]:
df.to_csv('test.csv',index=False)

In [51]:
df1=pd.read_csv('test.csv')
df1

   column1  column2  column3  column4
0        0        1        2        3
1        4        5        6        7
2        8        9       10       11
3       12       13       14       15
4       16       17       18       19

In [52]:
df.to_excel('test.xlsx')

In [53]:
pd.read_excel('test.xlsx')

  Unnamed: 0  column1  column2  column3  column4
0       row1        0        1        2        3
1       row2        4        5        6        7
2       row3        8        9       10       11
3       row4       12       13       14       15
4       row5       16       17       18       19

In [12]:
data='{"employee_name":"rahul","email":"rahulsharma@gmail.com","job_profile":[{"title":"team lead","role":"senior developer"}]}'

In [13]:
type(data)

str

In [14]:
data

'{"employee_name":"rahul","email":"rahulsharma@gmail.com","job_profile":[{"title":"team lead","role":"senior developer"}]}'

In [17]:
df2=pd.read_json(data)

In [18]:
df2

,employee_name,email,job_profile
0,rahul,rahulsharma@gmail.com,"{'title': 'team lead', 'role': 'senior develop..."

In [19]:
df2['salary']=100

In [20]:
df2

,employee_name,email,job_profile,salary
0,rahul,rahulsharma@gmail.com,"{'title': 'team lead', 'role': 'senior develop...",100

In [22]:
dict(df2['job_profile'])[0]['role']

'senior developer'

In [24]:
pd.read_json(data,orient='index')

                                                               0
employee_name                                              rahul
email                                      rahulsharma@gmail.com
job_profile    [{'title': 'team lead', 'role': 'senior develo...

In [25]:
pd.read_json(data,orient='records')

,employee_name,email,job_profile
0,rahul,rahulsharma@gmail.com,"{'title': 'team lead', 'role': 'senior develop..."

In [26]:
pd.read_json(data,orient='columns')

,employee_name,email,job_profile
0,rahul,rahulsharma@gmail.com,"{'title': 'team lead', 'role': 'senior develop..."